phil971-kant-rational-agency.org
#+TITLE: PHIL 971 - Kantian Conceptions of Rational Agency
#+DATE: July 2, 2020
#+AUTHOR: Colin McLear
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport archive nohugo
#+TODO: TODO NEXT | DONE CANCELED
#+TODO: DRAFT | DONE CANCELED
#+LANGUAGE: en
#+LATEX_HEADER: \usepackage[English]{babel}
#+OPTIONS: '":t

*** DONE Week 1 – Rationally Determinable Conditions & Kant’s Agent
SCHEDULED: <2020-08-18 Tue>
:PROPERTIES:
:EXPORT_HUGO_TAGS: action agency causality metaphysics rationality substance
:EXPORT_FILE_NAME: week1
:END:

This week we’ll go over the basic structure and themes of the course and then sketch
Kant’s view of agency. We start with a question: some conditions that an agent may be
in are rationally determinable. Others are not. How should we understand this
difference? More generally, how should we understand the notion of rationality, and
relatedly, of engaging in rational activity? We’ll look at Ram Neta’s setup of this
issue, before turning to Kant’s.

We’ll spend the rest of the meeting looking at some of Kant’s basic metaphysical
commitments regarding agency, specifically his conception of causation and the way in
which he construes an agent as a substance with causal powers to effect change in
itself or other beings.

- [[/materials/handouts/1-kants-agent.pdf][Handout]] for week 1

**** Readings
- Neta, [[/materials/readings/neta-RDCs.pdf][Rationally Determinable Conditions]]
   + We won’t discuss Neta’s positive view in much detail, but the opening pages are
     useful in setting up the issues we’ll be discussing.
- (Optional) Malmgren, [[/materials/readings/malmgren-responsibility.pdf][On Fundamental Responsibility]]
   + Likewise, we won’t look to closely at this point at Malmgren’s positive view,
     but her conception of “fundamental responsibility” is also useful for getting at
     issues central to the course.
- Kant’s Critical project
   + CPR: [[/materials/readings/CPR-preface-and-introduction.pdf][Preface & Introduction]] (Second edition)
      - If you need an overview (or refresher) of Kant’s project, this is one of his more useful statements.
   + CPJ: [[/materials/readings/CPJ-FI-III.pdf][First Introduction, §3]]
      - What’s of interest to us here is Kant’s conception of the connection between
        the Critical philosophy and the capacities of the rational mind.
   + (Optional) CPR: [[/materials/readings/kant-second-analogy.pdf][Second Analogy]]
      - There’s much more here than we can discuss in seminar, but directly relevant
        to his theory of causation.
- Kant on Action & Agent
   + McLear, “[[https://www.dropbox.com/s/8d6ar03pwhbstz6/substance.pdf?dl=0][Substance, Capacity, & Act]]”
      - This is my attempt to get clear on the some of the basic elements of Kant’s
        conception of an agent, and of activity. We’ll discuss issues relevant to
        §§1-2 in particular. 
   + (Optional) Watkins, [[/materials/readings/watkins-action.pdf][Kant on Action]]
      - A helpful discussion of how Kant’s conception of action fits in with his
        overall theory of substantial causality.
   + (Optional) Stang, [[/materials/readings/stang-ground.pdf][Guide to Ground in the /Lectures on Metaphysics/]]
      - A helpful discussion of Kant’s conception of “ground” (/Grund/), which is a
        central notion in his epistemology and metaphysics.


