content/assignments/week1.md
+++
title = "Week 1 – Rationally Determinable Conditions & Kant’s Agent"
publishDate = 2020-08-18T00:00:00-04:00
tags = ["action", "agency", "causality", "metaphysics", "rationality", "substance"]
draft = false
weight = -100
author = false
toc = false
type = "post"
+++

This week we’ll go over the basic structure and themes of the course and then sketch
Kant’s view of agency. We start with a question: some conditions that an agent may be
in are rationally determinable. Others are not. How should we understand this
difference? More generally, how should we understand the notion of rationality, and
relatedly, of engaging in rational activity? We’ll look at Ram Neta’s setup of this
issue, before turning to Kant’s.

We’ll spend the rest of the meeting looking at some of Kant’s basic metaphysical
commitments regarding agency, specifically his conception of causation and the way in
which he construes an agent as a substance with causal powers to effect change in
itself or other beings.

-   [Handout](/materials/handouts/1-kants-agent.pdf) for week 1


## Readings {#readings}

-   Neta, [Rationally Determinable Conditions](/materials/readings/neta-RDCs.pdf)
    -   We won’t discuss Neta’s positive view in much detail, but the opening pages are
        useful in setting up the issues we’ll be discussing.
-   (Optional) Malmgren, [On Fundamental Responsibility](/materials/readings/malmgren-responsibility.pdf)
    -   Likewise, we won’t look to closely at this point at Malmgren’s positive view,
        but her conception of “fundamental responsibility” is also useful for getting at
        issues central to the course.
-   Kant’s Critical project
    -   CPR: [Preface & Introduction](/materials/readings/CPR-preface-and-introduction.pdf) (Second edition)
        -   If you need an overview (or refresher) of Kant’s project, this is one of his more useful statements.
    -   CPJ: [First Introduction, §3](/materials/readings/CPJ-FI-III.pdf)
        -   What’s of interest to us here is Kant’s conception of the connection between
            the Critical philosophy and the capacities of the rational mind.
    -   (Optional) CPR: [Second Analogy](/materials/readings/kant-second-analogy.pdf)
        -   There’s much more here than we can discuss in seminar, but directly relevant
            to his theory of causation.
-   Kant on Action & Agent
    -   McLear, “[Substance, Capacity, & Act](https://www.dropbox.com/s/8d6ar03pwhbstz6/substance.pdf?dl=0)”
        -   This is my attempt to get clear on the some of the basic elements of Kant’s
            conception of an agent, and of activity. We’ll discuss issues relevant to
            §§1-2 in particular.
    -   (Optional) Watkins, [Kant on Action](/materials/readings/watkins-action.pdf)
        -   A helpful discussion of how Kant’s conception of action fits in with his
            overall theory of substantial causality.
    -   (Optional) Stang, [Guide to Ground in the _Lectures on Metaphysics_](/materials/readings/stang-ground.pdf)
        -   A helpful discussion of Kant’s conception of “ground” (_Grund_), which is a
            central notion in his epistemology and metaphysics.
